# Задача № 2
# Выполнить логические побитовые операции "И", "ИЛИ" и др. над числами 5 и 6. Выполнить
# над числом 5 побитовый сдвиг вправо и влево на два знака.

x, y, n = 5, 6, 2

b_and = x & y  # Побитовое "и"
b_or = x | y  # Побитовое "или"
b_or_exp = x ^ y  # Побитовое исключающее "или"
b_invert_x = ~x  # Инверсия битов
b_invert_y = ~y  # Инверсия битов
b_left = x << n  # Битовый сдвиг числа влево
b_right = x >> n  # Битовый сдвиг числа вправо

print(f'Побитовое "и" чисел {x}={bin(x)} и {y}={bin(y)} равно {b_and}={bin(b_and)}')
print(f'Побитовое "или" чисел {x}={bin(x)} и {y}={bin(y)} равно {b_or}={bin(b_or)}')
print(f'Побитовое исключающее "или" чисел {x}={bin(x)} и {y}={bin(y)} равно {b_or_exp}={bin(b_or_exp)}')
print(f'Инверсия битов числа {x}={bin(x)} равно {b_invert_x}={bin(b_invert_x)}')
print(f'Инверсия битов числа {y}={bin(y)} равно {b_invert_y}={bin(b_invert_y)}')
print(f'Битовый сдвиг числа {x}={bin(x)} на {n} знака влево равно {b_left}={bin(b_left)}')
print(f'Битовый сдвиг числа {x}={bin(x)} на {n} знака вправо равно {b_right}={bin(b_right)}')
