x, y, n = 5, 6, 2

b_and = x & y  # Побитовое "и"
b_or = x | y  # Побитовое "или"
b_left = x << n  # Битовый сдвиг числа влево
b_right = x >> n  # Битовый сдвиг числа вправо

print(f'Побитовое "и" чисел {x}={bin(x)} и {y}={bin(y)} равно {b_and}={bin(b_and)}')
print(f'Побитовое "или" чисел {x}={bin(x)} и {y}={bin(y)} равно {b_or}={bin(b_or)}')
print(f'Битовый сдвиг числа {x}={bin(x)} на {n} знака влево равно {b_left}={bin(b_left)}')
print(f'Битовый сдвиг числа {x}={bin(x)} на {n} знака вправо равно {b_right}={bin(b_right)}')
